import { NextPage } from 'next'

const PrivacyPolicy: NextPage = () => {
  return (
    <>
      <main className="pt-8 pb-16 lg:pt-16 lg:pb-24 bg-white dark:bg-gray-900 text-gray-900">
        <div className="flex justify-between px-4 mx-auto max-w-screen-xl ">
          <article className="mx-auto w-full max-w-2xl format format-sm sm:format-base lg:format-lg format-blue dark:format-invert">
            <header className="mb-4 lg:mb-6 not-format">
              <address className="flex items-center mb-6 not-italic">
                <div className="inline-flex items-center mr-3 text-sm text-gray-900 dark:text-white">
                  <div>
                    <span className="text-xl font-bold text-gray-900 dark:text-white">
                      클럽하우스
                    </span>
                    <p className="text-base font-light text-gray-500 dark:text-gray-400">
                      우리학교 모든 동아리, 클럽하우스에서 찾아봐!
                    </p>
                    <p className="text-base font-light text-gray-500 dark:text-gray-400"></p>
                  </div>
                </div>
              </address>
              <h1 className="mb-4 text-3xl font-extrabold leading-tight text-gray-900 lg:mb-6 lg:text-4xl dark:text-white">
                개인정보 처리방침
              </h1>
            </header>
            <p className="lead mb-4">
              클럽하우스는 「개인정보 보호법」 제30조에 따라 정보주체의 개인정보를 보호하고 이와
              관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보
              처리방침을 수립·공개합니다.
            </p>
            <p className="mb-4">
              ○ 이 개인정보처리방침은 2023년 1월 1부터 적용됩니다. 제1조(개인정보의 처리 목적)
              클럽하우스는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는
              다음의 목적 이외의 용도로는 이용되지 않으며 이용 목적이 변경되는 경우에는 「개인정보
              보호법」 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
            </p>
            <ol className="whitespace-pre-wrap">
              <li className="mb-4 text-sm">
                <div>
                  <strong>1. 홈페이지 회원가입 및 관리</strong>
                </div>
                회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리,
                서비스 부정이용 방지 목적으로 개인정보를 처리합니다.
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>2. 재화 또는 서비스 제공</strong>
                </div>
                서비스 제공, 콘텐츠 제공, 맞춤서비스 제공을 목적으로 개인정보를 처리합니다.
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>3. 마케팅 및 광고에의 활용</strong>
                </div>
                신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회
                제공 , 인구통계학적 특성에 따른 서비스 제공 및 광고 게재 등을 목적으로 개인정보를
                처리합니다. 제2조(개인정보의 처리 및 보유 기간) ① 클럽하우스은(는) 법령에 따른
                개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의받은 개인정보
                보유·이용기간 내에서 개인정보를 처리·보유합니다. ② 각각의 개인정보 처리 및 보유
                기간은 다음과 같습니다. 1 와 관련한 개인정보는 수집.이용에 관한 동의일로부터까지 위
                이용목적을 위하여 보유.이용됩니다. 보유근거 : 회사가 제공하는 재화 또는 서비스
                이용과 관련하여 수집된 개인정보는 회원의 수요 파악과 적절한 회원 서비스 제공 및 부정
                이용 방지를 위해 필요한 범위에서만 이용됩니다. 이에 대한 근거는 「개인정보보호법」
                제15조(개인정보의 보유 및 이용 기간)에서 규정하고 있습니다. 회사는 개인정보의 수집
                및 이용에 대해 회원의 동의를 얻으며, 수집한 개인정보는 명시된 사용 목적을 완수한
                경우 즉시 파기합니다. 또한, 회사는 개인정보 처리 시 개인정보 보호법 등 관련 법령에서
                요구하는 기술적, 관리적, 물리적 보호조치를 취하고 있으며, 이를 위한 필요한 내부 감사
                및 교육 등 사전 준비를 철저히 갖추고 있습니다. 관련법령 : 1)소비자의 불만 또는
                분쟁처리에 관한 기록 : 3년
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>4. 신용정보의 수집/처리 및 이용 등에 관한 기록 : 3년</strong>
                </div>
                예외사유 : 회사는 회원이 구매하거나 이용한 재화 또는 서비스 제공을 위해 회원의
                개인정보를 수집하고 이용합니다. 이용 목적 달성 이후에도 법령 또는 회사 내부 방침에
                따라 일정 기간 동안 개인정보를 보유할 수 있으며, 이는 다음과 같은 경우에 해당합니다.
                관련 법령에 의한 정보 보유: 전자상거래 관련법 등에 의하여 보존되어야 할 정보 및
                기간이 명시되어 있는 경우에는 해당 기간 동안 보유합니다. 계약 또는 청약 철회 등에
                관한 기록: 5년 대금결제 및 재화 등의 공급에 관한 기록: 5년 소비자 불만 또는
                분쟁처리에 관한 기록: 3년 회원의 재가입 요청: 회원 탈퇴 후 일정 기간 내에 재가입을
                원하는 경우를 대비하여 일정 기간 동안 개인정보를 보관할 수 있습니다. 분쟁 해결 및
                환불, 청약철회 등을 위한 보유: 계약 당사자, 청약철회, 반품, 환불을 청구한 경우 또는
                분쟁이 발생한 경우 관련 정보를 일정 기간 보관합니다. 이에 대한 근거는
                「개인정보보호법」 제15조(개인정보의 보유 및 이용기간)에서 규정하고 있습니다. 회사는
                처리 목적 달성 이후 보유기간이 경과한 개인정보를 지체 없이 파기하며, 복원 또는
                복구가 불가능한 상태로 처리합니다. 2 와 관련한 개인정보는 수집.이용에 관한
                동의일로부터까지 위 이용목적을 위하여 보유.이용됩니다. 보유근거 : 홈페이지 회원가입
                및 관리를 위해 수집된 개인정보는 회원가입 시 동의 받은 목적 이외에는 사용되지
                않으며, 관련 법령에 의거하여 안전하게 보관됩니다. 이에 대한 근거는
                「개인정보보호법」 제10조(수집하는 개인정보의 항목), 제15조(개인정보의 보유 및 이용
                기간), 제17조(개인정보의 파기) 등에 명시되어 있습니다. 또한, 회사는 이용자 개인정보
                처리에 대한 동의를 받을 때 반드시 해당 개인정보 처리방침을 공개하고 안내합니다.
                따라서, 회원가입 및 관리와 관련하여 수집한 개인정보는 법적 근거에 의해 안전하게
                보유되며, 회원 탈퇴 시 또는 보유기간이 만료될 경우에는 지체 없이 파기합니다.
                관련법령 : 표시/광고에 관한 기록 : 6개월 3 와 관련한 개인정보는 수집.이용에 관한
                동의일로부터까지 위 이용목적을 위하여 보유.이용됩니다. 보유근거 : 회사는 회원의
                개인정보를 회원의 동의 없이 마케팅 및 광고 목적으로 사용하지 않습니다. 다만, 회원의
                개인정보를 광고주에게 제공하여 광고 서비스를 제공할 경우에는 개인정보 보호법에서
                정한 바에 따라 전자적 방법 등으로 개인정보를 안전하게 관리하며, 광고주와의 개인정보
                처리계약 등을 통해 이용목적, 이용기간, 보유 및 이용기간, 이용자 자기결정권 등을
                상세히 규정, 준수하고 있습니다. 이에 대한 근거는 「개인정보보호법」
                제18조(개인정보의 제3자 제공)에서 규정하고 있습니다. 회사는 귀중한 회원 정보를
                존중하며, 회원의 개인정보를 무단으로 이용하거나 제3자에게 제공할 경우 회원의 동의를
                받으며, 회원의 동의 없이 개인정보를 공개하지 않습니다. 관련법령 : 소비자의 불만 또는
                분쟁처리에 관한 기록 : 3년 제3조(처리하는 개인정보의 항목) ① 클럽하우스은(는) 다음의
                개인정보 항목을 처리하고 있습니다. 1홈페이지 회원가입 및 관리 필수항목 : 이름,
                생년월일, 성별, 로그인ID, 비밀번호, 휴대전화번호, 이메일, 학력 선택항목 : 접속 IP
                정보, 쿠키, 접속 로그, 서비스 이용 기록 제4조(개인정보의 제3자 제공에 관한 사항) ①
                클럽하우스은(는) 개인정보를 제1조(개인정보의 처리 목적)에서 명시한 범위 내에서만
                처리하며, 정보주체의 동의, 법률의 특별한 규정 등 「개인정보 보호법」 제17조 및
                제18조에 해당하는 경우에만 개인정보를 제3자에게 제공합니다. ② 클럽하우스은(는)
                다음과 같이 개인정보를 제3자에게 제공하고 있습니다.
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>
                    5. 제공받는 자의 정보와 제공 목적은 사전에 명시되어 있으며, 개인정보 제공은 해당
                    목적 범위 내에서만 이루어집니다.
                  </strong>
                </div>
                개인정보를 제공받는 자 : 제공받는 자의 정보와 제공 목적은 사전에 명시되어 있으며,
                개인정보 제공은 해당 목적 범위 내에서만 이루어집니다. 제공받는 자의 개인정보
                이용목적 : 생년월일, 성별, 로그인ID, 이메일, 직업, 학력, 서비스 이용 기록 제공받는
                자의 보유.이용기간: 1년 제5조(개인정보처리의 위탁에 관한 사항) ① 클럽하우스은(는)
                원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>6</strong>
                </div>
                ② 클럽하우스은(는) 위탁계약 체결시 「개인정보 보호법」 제26조에 따라 위탁업무
                수행목적 외 개인정보 처리금지, 기술적․관리적 보호조치, 재위탁 제한, 수탁자에 대한
                관리․감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가
                개인정보를 안전하게 처리하는지를 감독하고 있습니다. ③ 위탁업무의 내용이나 수탁자가
                변경될 경우에는 지체없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.
                제6조(개인정보의 파기절차 및 파기방법) ① 클럽하우스은(는) 개인정보 보유기간의 경과,
                처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를
                파기합니다. ② 정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이
                달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는,
                해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>7. 법령 근거 :</strong>
                </div>
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>8. 보존하는 개인정보 항목 : 계좌정보, 거래날짜</strong>
                </div>
                ③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>9. 파기절차</strong>
                </div>
                클럽하우스 은(는) 파기 사유가 발생한 개인정보를 선정하고, 클럽하우스 의 개인정보
                보호책임자의 승인을 받아 개인정보를 파기합니다.
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>10. 파기방법</strong>
                </div>
                종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다. 전자적 파일
                형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다 제7조(정보주체와
                법정대리인의 권리·의무 및 그 행사방법에 관한 사항) ① 정보주체는 클럽하우스에 대해
                언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다. ②
                제1항에 따른 권리 행사는클럽하우스에 대해 「개인정보 보호법」 시행령 제41조제1항에
                따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 클럽하우스은(는) 이에
                대해 지체 없이 조치하겠습니다. ③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나
                위임을 받은 자 등 대리인을 통하여 하실 수 있습니다.이 경우 “개인정보 처리 방법에
                관한 고시(제2020-7호)” 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다. ④
                개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제35조 제4항, 제37조 제2항에
                의하여 정보주체의 권리가 제한 될 수 있습니다. ⑤ 개인정보의 정정 및 삭제 요구는 다른
                법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수
                없습니다. ⑥ 클럽하우스은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구,
                처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.
                제8조(개인정보의 안전성 확보조치에 관한 사항) 클럽하우스은(는) 개인정보의 안전성
                확보를 위해 다음과 같은 조치를 취하고 있습니다.
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>11. 내부관리계획의 수립 및 시행</strong>
                </div>
                개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>12. 개인정보에 대한 접근 제한</strong>
                </div>
                개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여
                개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을
                이용하여 외부로부터의 무단 접근을 통제하고 있습니다.
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>13. 해킹 등에 대비한 기술적 대책</strong>
                </div>
                해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여
                보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에
                시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.
              </li>
              <li className="mb-4 text-sm">
                <div>
                  <strong>14. 문서보안을 위한 잠금장치 사용</strong>
                </div>
                개인정보가 포함된 서류, 보조저장매체 등을 잠금장치가 있는 안전한 장소에 보관하고
                있습니다. 제9조(개인정보를 자동으로 수집하는 장치의 설치·운영 및 그 거부에 관한
                사항) ① 클럽하우스 은(는) 이용자에게 개별적인 맞춤서비스를 제공하기 위해 이용정보를
                저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용합니다. ② 쿠키는 웹사이트를 운영하는데
                이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며 이용자들의
                PC 컴퓨터내의 하드디스크에 저장되기도 합니다. 가. 쿠키의 사용 목적 : 이용자가 방문한
                각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을
                파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다. 나. 쿠키의 설치•운영 및
                거부 : 웹브라우저 상단의 도구 - 인터넷 옵션 -개인정보 메뉴의 옵션 설정을 통해 쿠키
                저장을 거부 할 수 있습니다. 다. 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에
                어려움이 발생할 수 있습니다.
              </li>
            </ol>
          </article>
        </div>
      </main>

      <footer className="bg-gray-50 dark:bg-gray-800">
        <div className="p-4 py-6 mx-auto max-w-screen-xl md:p-8 lg:p-10">
          <div className="text-center">
            <span className="block text-sm text-center text-gray-500 dark:text-gray-400">
              © 2023{' '}
              <a href="#" className="hover:underline">
                클럽하우스
              </a>
              . All Rights Reserved.
            </span>
          </div>
        </div>
      </footer>
    </>
  )
}

export default PrivacyPolicy
